OPad-dev/OPad/firmware/sdkconfig.defaults
# ESP32-S3 Native USB and TinyUSB Configuration
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHMODE_DIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

# FreeRTOS 1000 Hz tick for microsecond-level timing and 1ms USB polling
CONFIG_FREERTOS_HZ=1000

# TinyUSB Composite Device (HID Keyboard + CDC ACM)
CONFIG_TINYUSB=y
CONFIG_TINYUSB_CDC_ENABLED=y
CONFIG_TINYUSB_HID_ENABLED=y
CONFIG_TINYUSB_HID_COUNT=1
CONFIG_TINYUSB_CDC_COUNT=1

# High stack sizes for tasks
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# PSRAM Support (Octal PSRAM on ESP32-S3R8)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
